{
  "heavenlyStems": ["갑", "을", "병", "정", "무", "기", "경", "신", "임", "계"],
  "earthlyBranches": ["자", "축", "인", "묘", "진", "사", "오", "미", "신", "유", "술", "해"],
  "elements": {
    "갑": "목", "을": "목", "병": "화", "정": "화", "무": "토",
    "기": "토", "경": "금", "신": "금", "임": "수", "계": "수"
  },
  "branchElements": {
    "자": "수", "축": "토", "인": "목", "묘": "목", "진": "토", "사": "화",
    "오": "화", "미": "토", "신": "금", "유": "금", "술": "토", "해": "수"
  },
  "animals": {
    "자": "쥐", "축": "소", "인": "호랑이", "묘": "토끼", "진": "용", "사": "뱀",
    "오": "말", "미": "양", "신": "원숭이", "유": "닭", "술": "개", "해": "돼지"
  },
  "personalities": {
    "갑": {
      "name": "갑목 - 큰 나무의 기상",
      "description": "갑목은 큰 나무, 즉 소나무나 참나무와 같은 거대한 수목을 상징합니다. 당신은 마치 깊은 뿌리를 내린 거대한 나무처럼 흔들림 없는 신념과 굳건한 의지를 가지고 있습니다. 천성적으로 리더십이 강하며, 주변 사람들에게 그늘을 제공하고 보호하려는 성향이 강합니다.\n\n갑목인의 가장 큰 특징은 정직함과 곧은 성품입니다. 타협하지 않는 원칙주의자로서, 옳지 않다고 생각하는 일에는 절대 굽히지 않는 강인함을 보입니다. 이런 성격 때문에 때로는 고집스럽게 보일 수 있지만, 이는 당신의 신념에 대한 확고함에서 비롯된 것입니다.\n\n대인관계에서는 따뜻하면서도 권위적인 면을 동시에 가지고 있습니다. 부하나 후배들을 아끼고 보살피는 마음이 크지만, 동시에 질서와 규칙을 중요하게 여기며 책임감이 매우 강합니다. 조직에서는 자연스럽게 리더 역할을 맡게 되며, 다른 사람들도 당신의 카리스마와 안정감을 신뢰하게 됩니다.",
      "traits": ["천부적 리더십", "불굴의 의지", "강한 책임감", "정직함", "보호본능", "원칙주의", "카리스마", "안정감"]
    },
    "을": {
      "name": "을목 - 유연한 풀의 지혜",
      "description": "을목은 부드럽고 유연한 풀이나 꽃, 덩굴식물을 상징합니다. 당신은 어떤 환경에서도 적응하며 살아남을 수 있는 놀라운 생명력과 유연성을 가지고 있습니다. 갑목의 강직함과는 달리, 을목은 상황에 따라 자신을 변화시킬 줄 아는 지혜를 가지고 있습니다.\n\n을목인의 가장 큰 장점은 뛰어난 감수성과 섬세함입니다. 다른 사람의 마음을 잘 읽고 공감하는 능력이 뛰어나며, 예술적 재능을 가진 경우가 많습니다. 또한 변화하는 상황에 빠르게 적응하며, 창의적인 해결책을 찾아내는 능력이 뛰어납니다.\n\n대인관계에서는 조화를 중시하며, 갈등을 피하려고 노력합니다. 때로는 자신의 의견을 뒤로 미루고 다른 사람의 의견에 맞춰주는 경향이 있지만, 이는 평화를 사랑하는 당신의 본성에서 비롯된 것입니다. 은근한 매력과 부드러운 카리스마로 사람들을 자연스럽게 끌어들이는 힘을 가지고 있습니다.\n\n을목인은 또한 성장 지향적입니다. 끊임없이 배우고 발전하려는 의지가 강하며, 새로운 경험과 도전을 두려워하지 않습니다. 다만 때로는 우유부단해 보일 수 있으나, 이는 신중하게 모든 가능성을 고려하는 당신의 사려 깊음에서 나오는 것입니다.",
      "traits": ["뛰어난 적응력", "예술적 감각", "섬세한 감수성", "조화 추구", "창의성", "성장 지향", "공감 능력", "평화주의"]
    },
    "병": {
      "name": "병화 - 태양의 열정",
      "description": "병화는 태양을 상징하며, 모든 생명체에게 에너지를 주는 근원적인 힘을 나타냅니다. 당신은 마치 태양처럼 밝고 따뜻한 에너지를 발산하며, 주변 사람들에게 활력과 희망을 주는 존재입니다. 천성적으로 낙천적이고 긍정적인 성격을 가지고 있어, 어떤 어려움도 밝게 헤쳐나가는 힘을 가지고 있습니다.\n\n병화인의 가장 큰 특징은 강렬한 열정과 추진력입니다. 한 번 마음먹은 일은 끝까지 해내는 강한 의지력을 가지고 있으며, 다른 사람들을 감화시키고 동기부여하는 능력이 뛰어납니다. 자연스럽게 관심의 중심이 되며, 사람들은 당신의 에너지에 이끌려 모여들게 됩니다.\n\n대인관계에서는 매우 사교적이고 외향적입니다. 새로운 사람들과 쉽게 친해지며, 분위기를 밝게 만드는 재주가 있습니다. 파티나 모임에서는 자연스럽게 중심 인물이 되며, 모든 사람을 즐겁게 만들어줍니다. 하지만 때로는 너무 강한 에너지 때문에 다른 사람을 압도할 수 있으니 주의가 필요합니다.\n\n병화인은 또한 정의감이 강하고 공정함을 중시합니다. 불의를 보면 참지 못하며, 약자를 보호하려는 마음이 큽니다. 리더십 능력이 뛰어나지만, 갑목과는 달리 카리스마보다는 친화력으로 사람들을 이끌어갑니다. 창조적이고 혁신적인 아이디어를 많이 가지고 있어, 새로운 분야를 개척하는 능력이 뛰어납니다.",
      "traits": ["강렬한 열정", "천부적 낙천성", "뛰어난 사교성", "리더십", "정의감", "창조력", "추진력", "감화력"]
    },
    "정": {
      "name": "정화 - 촛불의 따뜻함",
      "description": "정화는 촛불이나 등불과 같은 부드럽고 따뜻한 불을 상징합니다. 병화의 강렬함과는 달리, 정화는 은은하면서도 지속적인 온기를 제공합니다. 당신은 마치 어두운 밤을 밝히는 촛불처럼, 조용하지만 확실한 존재감으로 주변 사람들에게 위로와 안정감을 주는 사람입니다.\n\n정화인의 가장 큰 특징은 깊은 배려심과 세심함입니다. 다른 사람의 마음을 잘 헤아리며, 필요한 때에 적절한 도움을 주는 능력이 뛰어납니다. 화려하게 드러내지는 않지만, 묵묵히 자신의 역할을 다하며 조직이나 가정의 중심축 역할을 하는 경우가 많습니다.\n\n대인관계에서는 온화하고 친근한 성격으로 많은 사람들에게 사랑받습니다. 갈등 상황에서는 중재자 역할을 자주 맡으며, 양쪽의 입장을 이해하고 조화로운 해결책을 찾아내는 능력이 뛰어납니다. 또한 인내심이 강해서 어려운 상황에서도 꾸준히 버틸 수 있는 힘을 가지고 있습니다.\n\n정화인은 전통과 예의를 중시하며, 질서 있는 생활을 선호합니다. 급진적인 변화보다는 점진적이고 안정적인 발전을 추구하며, 장기적인 관점에서 문제를 바라보는 지혜를 가지고 있습니다. 교육이나 상담 분야에서 뛰어난 능력을 발휘하는 경우가 많으며, 다른 사람의 성장과 발전을 도와주는 일에서 큰 보람을 느낍니다.",
      "traits": ["깊은 배려심", "온화한 성품", "뛰어난 인내력", "중재 능력", "전통 중시", "세심함", "안정 추구", "교육적 재능"]
    },
    "무": {
      "name": "무토 - 산의 포용력",
      "description": "무토는 높은 산이나 언덕을 상징하며, 모든 것을 포용하고 받아들이는 거대한 품을 나타냅니다. 당신은 마치 우뚝 선 산처럼 든든하고 안정적인 존재로, 주변 사람들에게 신뢰감과 안정감을 주는 사람입니다. 변하지 않는 믿음직함으로 많은 사람들이 당신을 의지하게 됩니다.\n\n무토인의 가장 큰 특징은 넓은 포용력과 관대함입니다. 다른 사람의 단점이나 실수를 쉽게 용서하며, 편견 없이 모든 사람을 받아들이는 마음이 큽니다. 또한 현실적이고 실용적인 사고를 가지고 있어, 추상적인 이론보다는 실제로 도움이 되는 조언과 해결책을 제시하는 능력이 뛰어납니다.\n\n대인관계에서는 신뢰할 수 있는 조언자 역할을 자주 맡습니다. 침착하고 균형잡힌 판단력으로 다른 사람들의 고민을 들어주고, 실질적인 도움을 제공합니다. 감정적으로 격해지는 상황에서도 냉정함을 유지하며, 객관적인 시각으로 문제를 바라볼 수 있는 능력을 가지고 있습니다.\n\n무토인은 또한 끈기와 지구력이 뛰어납니다. 한 번 시작한 일은 끝까지 완수하려는 의지가 강하며, 어려움이 있어도 포기하지 않고 꾸준히 노력합니다. 변화보다는 안정을 선호하지만, 필요한 경우에는 현명한 판단으로 적절한 변화를 이끌어내기도 합니다. 조직에서는 든든한 기둥 역할을 하며, 위기 상황에서 특히 그 진가를 발휘합니다.",
      "traits": ["넓은 포용력", "현실적 사고", "뛰어난 신뢰성", "강한 지구력", "균형감각", "관대함", "안정 추구", "조언 능력"]
    },
    "기": {
      "name": "기토 - 옥토의 생산력",
      "description": "기토는 비옥한 밭이나 농토를 상징하며, 생명을 기르고 키우는 생산적인 에너지를 나타냅니다. 당신은 마치 모든 식물이 잘 자랄 수 있도록 영양분을 제공하는 기름진 땅처럼, 주변 사람들의 성장과 발전을 도와주는 사람입니다. 근면하고 성실한 성격으로 묵묵히 자신의 일을 해내는 신뢰할 수 있는 존재입니다.\n\n기토인의 가장 큰 특징은 뛰어난 실행력과 꾸준함입니다. 화려한 아이디어나 거창한 계획보다는, 작은 일이라도 확실하게 해내는 것을 중시합니다. 일단 계획을 세우면 차근차근 단계를 밟아가며 목표를 달성하는 능력이 뛰어나며, 중도에 포기하는 일이 거의 없습니다.\n\n대인관계에서는 겸손하고 배려심 깊은 모습을 보입니다. 자신을 드러내기보다는 다른 사람을 도와주는 일에서 기쁨을 찾으며, 팀워크를 중시합니다. 또한 세심한 관찰력으로 다른 사람이 놓치기 쉬운 부분까지 챙겨주는 능력이 있어, 주변 사람들로부터 많은 신뢰를 받습니다.\n\n기토인은 물질적인 안정을 중시하며, 절약하고 저축하는 습관이 몸에 배어 있습니다. 하지만 이는 인색함이 아니라 미래를 대비하는 지혜에서 나오는 것입니다. 가족이나 가까운 사람들을 위해서는 아낌없이 투자하며, 실질적인 도움을 주려고 노력합니다. 또한 전통적인 가치를 소중히 여기며, 예의와 질서를 중시하는 보수적인 면도 가지고 있습니다.",
      "traits": ["뛰어난 실행력", "꾸준한 노력", "세심한 배려", "실용적 사고", "절약 정신", "겸손함", "전통 중시", "팀워크"]
    },
    "경": {
      "name": "경금 - 칼날의 예리함",
      "description": "경금은 칼이나 도끼와 같은 날카로운 금속을 상징하며, 강인하고 예리한 판단력을 나타냅니다. 당신은 마치 잘 벼려진 명검처럼 결단력 있고 명확한 성격을 가지고 있습니다. 복잡한 상황에서도 핵심을 정확히 파악하고, 과감하게 결정을 내리는 능력이 뛰어납니다.\n\n경금인의 가장 큰 특징은 강한 정의감과 원칙주의입니다. 옳고 그름에 대한 기준이 명확하며, 불의를 보면 참지 못하고 나서는 성격입니다. 또한 매우 논리적이고 합리적인 사고를 가지고 있어, 감정에 휘둘리지 않고 객관적인 판단을 내릴 수 있습니다.\n\n대인관계에서는 직설적이고 솔직한 성격으로, 때로는 너무 직접적이어서 상대방이 상처받을 수 있습니다. 하지만 이는 악의가 아니라 진심어린 충고나 조언을 하려는 마음에서 비롯된 것입니다. 신뢰할 수 있는 사람에게는 깊은 충성심을 보이며, 어려운 상황에서도 배신하지 않는 의리를 지킵니다.\n\n경금인은 또한 완벽주의적 성향이 강합니다. 자신이 맡은 일은 최고 수준으로 완성하려고 노력하며, 타협하지 않는 품질 기준을 가지고 있습니다. 리더십 능력이 뛰어나지만, 때로는 너무 엄격한 기준 때문에 부하들이 부담을 느낄 수 있습니다. 하지만 이런 엄격함은 자신에게 더욱 가혹하게 적용되며, 끊임없는 자기계발을 통해 성장하려고 노력합니다.",
      "traits": ["강한 정의감", "뛰어난 결단력", "논리적 사고", "완벽주의", "솔직함", "원칙주의", "리더십", "자기계발"]
    },
    "신": {
      "name": "신금 - 보석의 품격",
      "description": "신금은 금이나 은, 보석과 같은 귀중한 금속을 상징하며, 세련되고 우아한 품격을 나타냅니다. 당신은 마치 정교하게 다듬어진 보석처럼 세밀하고 완벽한 것을 추구하는 성격을 가지고 있습니다. 높은 미적 감각과 품위 있는 태도로 주변 사람들에게 좋은 인상을 주는 사람입니다.\n\n신금인의 가장 큰 특징은 뛰어난 분석력과 섬세함입니다. 작은 디테일까지 놓치지 않고 세심하게 관찰하는 능력이 있으며, 복잡한 문제를 차근차근 분석해서 해결하는 것을 좋아합니다. 또한 예술적 감각이 뛰어나며, 아름다운 것에 대한 안목이 남다릅니다.\n\n대인관계에서는 품격 있고 우아한 매너로 사람들에게 좋은 인상을 줍니다. 하지만 내면적으로는 까다로운 면이 있어서, 쉽게 마음을 열지 않고 신중하게 사람을 사귑니다. 한 번 친해지면 매우 충성스럽고 세심한 배려를 보여주지만, 그렇지 않은 사람에게는 다소 차갑게 느껴질 수 있습니다.\n\n신금인은 완벽을 추구하는 성향이 매우 강합니다. 자신의 일에서는 물론이고, 외모나 생활 환경에서도 높은 기준을 유지하려고 노력합니다. 때로는 이런 완벽주의 때문에 스트레스를 받기도 하지만, 이를 통해 다른 사람들이 따라올 수 없는 고품질의 결과물을 만들어내는 능력을 가지고 있습니다. 또한 변화에 대해서는 신중한 편이며, 충분히 검토하고 준비한 후에 행동하는 것을 선호합니다.",
      "traits": ["뛰어난 분석력", "예술적 감각", "완벽주의", "품격", "섬세함", "신중함", "미적 안목", "고품질 추구"]
    },
    "임": {
      "name": "임수 - 바다의 포용력",
      "description": "임수는 바다나 큰 강과 같은 거대한 물을 상징하며, 무한한 포용력과 깊이를 나타냅니다. 당신은 마치 모든 것을 받아들이는 바다처럼 넓은 마음과 깊은 지혜를 가진 사람입니다. 겉으로는 평온해 보이지만, 내면에는 엄청난 에너지와 잠재력을 간직하고 있습니다.\n\n임수인의 가장 큰 특징은 뛰어난 적응력과 유연성입니다. 어떤 상황에 처해도 그 환경에 맞게 자신을 변화시킬 수 있는 능력이 있으며, 고정관념에 얽매이지 않고 자유로운 사고를 합니다. 또한 직감력이 매우 뛰어나서, 논리적 분석 없이도 상황의 본질을 파악하는 능력을 가지고 있습니다.\n\n대인관계에서는 포용력이 넓고 이해심이 깊어서 많은 사람들이 당신에게 고민을 털어놓습니다. 다른 사람의 입장에서 생각할 줄 알며, 편견 없이 모든 사람을 받아들이는 마음을 가지고 있습니다. 하지만 때로는 너무 많은 것을 받아들이려다가 자신만의 정체성을 잃을 위험도 있으니 주의가 필요합니다.\n\n임수인은 학습 능력이 뛰어나고 지적 호기심이 많습니다. 새로운 지식이나 경험을 흡수하는 능력이 빠르며, 다양한 분야에 관심을 가지고 공부하는 것을 좋아합니다. 또한 창조적이고 상상력이 풍부해서 예술이나 창작 분야에서 좋은 능력을 발휘할 수 있습니다. 다만 너무 많은 것에 관심을 가지다 보면 집중력이 분산될 수 있으니, 중요한 것에 우선순위를 두는 것이 중요합니다.",
      "traits": ["무한한 포용력", "뛰어난 적응력", "직감력", "학습 능력", "창조성", "유연한 사고", "이해심", "자유로움"]
    },
    "계": {
      "name": "계수 - 이슬의 순수함",
      "description": "계수는 이슬이나 빗방울과 같은 순수하고 깨끗한 물을 상징하며, 섬세하고 감성적인 성격을 나타냅니다. 당신은 마치 맑은 이슬처럼 순수하고 투명한 마음을 가진 사람으로, 세상의 아름다움과 미묘한 감정들을 깊이 느끼고 표현하는 능력이 뛰어납니다.\n\n계수인의 가장 큰 특징은 풍부한 감수성과 뛰어난 직관력입니다. 다른 사람들이 놓치기 쉬운 미묘한 변화나 감정의 변화를 민감하게 감지할 수 있으며, 예술적 영감을 받는 경우가 많습니다. 또한 매우 순수하고 진실한 성격으로, 거짓이나 가식을 싫어하며 진심으로 사람들과 소통하려고 노력합니다.\n\n대인관계에서는 따뜻하고 친근한 성격으로 사람들에게 편안함을 줍니다. 다른 사람의 아픔이나 고민에 깊이 공감하며, 진심어린 위로와 격려를 해주는 능력이 뛰어납니다. 하지만 너무 감정적으로 몰입하다 보면 자신도 상처받기 쉬우니, 적당한 거리감을 유지하는 것이 중요합니다.\n\n계수인은 변화와 성장을 좋아합니다. 고정된 틀에 갇히기보다는 새로운 경험과 도전을 통해 자신을 발전시키려고 노력하며, 끊임없이 배우고 성장하려는 의지가 강합니다. 또한 이상주의적 성향이 있어서 더 나은 세상을 만들기 위해 노력하며, 사회적 가치나 의미 있는 일에 관심이 많습니다. 다만 현실과 이상 사이의 갭 때문에 실망하거나 좌절할 수 있으니, 현실적인 계획과 단계적 접근이 필요합니다.",
      "traits": ["풍부한 감수성", "뛰어난 직관력", "순수함", "공감 능력", "성장 지향", "이상주의", "예술적 재능", "진실성"]
    }
  },
  "compatibility": {
    "목": {
      "good": ["수", "화"],
      "bad": ["금", "토"],
      "neutral": ["목"],
      "detailed": {
        "수": "수는 목을 기르는 관계로, 물이 나무를 자라게 하듯 서로에게 도움이 되는 최고의 궁합입니다. 수 오행의 사람은 당신의 성장과 발전을 도와주며, 당신도 그들에게 안정감과 방향성을 제공합니다. 연애에서는 서로를 이해하고 지지해주는 관계가 되며, 사업에서는 상호 보완적인 파트너십을 이룰 수 있습니다.",
        "화": "목은 화를 만드는 관계로, 나무가 불의 연료가 되듯 당신의 에너지가 상대방의 열정을 더욱 강하게 만들어줍니다. 화 오행의 사람과는 서로 자극하며 발전하는 관계를 만들 수 있으며, 창조적이고 역동적인 파트너십이 가능합니다.",
        "금": "금은 목을 자르는 관계로, 도끼가 나무를 베듯 갈등이 생기기 쉬운 궁합입니다. 금 오행의 사람과는 가치관의 차이로 인한 마찰이 있을 수 있으나, 서로의 장점을 인정하고 노력한다면 성장할 수 있는 관계입니다.",
        "토": "토는 목의 양분을 빼앗는 관계로, 나무뿌리가 토양의 영양분을 흡수하듯 한쪽이 다른 쪽을 소모시키는 관계입니다. 토 오행의 사람과는 서로 다른 속도와 방식으로 인해 피로감을 느낄 수 있습니다."
      }
    },
    "화": {
      "good": ["목", "토"],
      "bad": ["수", "금"],
      "neutral": ["화"],
      "detailed": {
        "목": "목은 화를 기르는 관계로, 나무가 불의 연료가 되어 더욱 크고 밝은 불꽃을 만들어내듯 최고의 궁합입니다. 목 오행의 사람은 당신의 열정과 에너지를 더욱 강하게 만들어주며, 당신의 꿈과 목표를 실현하는데 큰 도움이 됩니다.",
        "토": "화는 토를 만드는 관계로, 불이 타고 난 후 재가 되어 토양을 비옥하게 하듯 서로에게 도움이 되는 관계입니다. 토 오행의 사람과는 안정적이고 지속가능한 관계를 만들 수 있으며, 당신의 열정이 상대방에게 실질적인 결과를 가져다줍니다.",
        "수": "수는 화를 끄는 관계로, 물이 불을 끄듯 서로 상충하는 에너지를 가지고 있어 갈등이 생기기 쉽습니다. 수 오행의 사람과는 접근 방식의 차이로 인한 오해가 생길 수 있으나, 균형을 찾으면 서로를 보완할 수 있습니다.",
        "금": "화는 금을 녹이는 관계로, 불꽃이 금속을 녹이듯 당신의 강한 에너지가 상대방을 압도할 수 있습니다. 금 오행의 사람과는 서로 다른 표현 방식으로 인한 갈등이 있을 수 있습니다."
      }
    },
    "토": {
      "good": ["화", "금"],
      "bad": ["목", "수"],
      "neutral": ["토"],
      "detailed": {
        "화": "화는 토를 기르는 관계로, 불이 타고 난 재가 토양을 비옥하게 하듯 최고의 궁합입니다. 화 오행의 사람은 당신에게 에너지와 활력을 불어넣어주며, 당신의 안정감과 포용력이 상대방의 열정을 현실화시켜줍니다.",
        "금": "토는 금을 만드는 관계로, 땅속에서 금속이 만들어지듯 당신이 상대방의 재능을 키워주는 관계입니다. 금 오행의 사람과는 서로의 장점을 살려주는 상호 보완적인 파트너십을 만들 수 있습니다.",
        "목": "목은 토의 양분을 흡수하는 관계로, 나무뿌리가 토양의 영양분을 빨아들이듯 한쪽이 다른 쪽을 소모시키는 관계입니다. 목 오행의 사람과는 에너지 소모가 클 수 있으나, 적절한 거리감을 유지하면 조화로운 관계가 가능합니다.",
        "수": "토는 수를 막는 관계로, 흙이 물의 흐름을 막듯 서로 다른 방향성으로 인한 갈등이 생기기 쉽습니다. 수 오행의 사람과는 속도와 접근 방식의 차이로 인한 마찰이 있을 수 있습니다."
      }
    },
    "금": {
      "good": ["토", "수"],
      "bad": ["화", "목"],
      "neutral": ["금"],
      "detailed": {
        "토": "토는 금을 기르는 관계로, 땅속에서 금속이 만들어지듯 최고의 궁합입니다. 토 오행의 사람은 당신의 재능과 능력을 키워주고 발전시켜주며, 당신도 상대방에게 명확한 방향성과 결과를 제공해줍니다.",
        "수": "금은 수를 만드는 관계로, 금속 표면에 이슬이 맺히듯 당신이 상대방에게 영감과 아이디어를 제공하는 관계입니다. 수 오행의 사람과는 지적이고 창조적인 파트너십을 만들 수 있으며, 서로의 사고를 확장시켜줍니다.",
        "화": "화는 금을 녹이는 관계로, 불꽃이 금속을 녹이듯 강한 에너지의 충돌이 일어나기 쉬운 궁합입니다. 화 오행의 사람과는 표현 방식과 가치관의 차이로 인한 갈등이 있을 수 있으나, 서로를 인정하면 성장할 수 있습니다.",
        "목": "금은 목을 자르는 관계로, 도끼가 나무를 베듯 당신의 예리함이 상대방에게 부담이 될 수 있습니다. 목 오행의 사람과는 접근 방식의 차이로 인한 오해가 생기기 쉽습니다."
      }
    },
    "수": {
      "good": ["금", "목"],
      "bad": ["토", "화"],
      "neutral": ["수"],
      "detailed": {
        "금": "금은 수를 기르는 관계로, 금속 표면에 이슬이 맺히듯 최고의 궁합입니다. 금 오행의 사람은 당신에게 명확한 방향성과 구체적인 아이디어를 제공해주며, 당신의 유연함과 적응력이 상대방의 계획을 현실화시켜줍니다.",
        "목": "수는 목을 기르는 관계로, 물이 나무를 자라게 하듯 당신이 상대방의 성장과 발전을 도와주는 관계입니다. 목 오행의 사람과는 서로를 지지하고 격려하는 이상적인 파트너십을 만들 수 있습니다.",
        "토": "토는 수를 막는 관계로, 흙이 물의 흐름을 막듯 서로 다른 에너지로 인한 갈등이 생기기 쉽습니다. 토 오행의 사람과는 속도와 방법론의 차이로 인한 답답함을 느낄 수 있습니다.",
        "화": "수는 화를 끄는 관계로, 물이 불을 끄듯 서로 상반된 에너지를 가지고 있어 충돌하기 쉬운 궁합입니다. 화 오행의 사람과는 표현 방식과 우선순위의 차이로 인한 갈등이 있을 수 있습니다."
      }
    }
  },
  "fortune": {
    "목": {
      "career": "목 오행의 당신은 창조적이고 성장 지향적인 분야에서 빛을 발할 운명입니다. 교육, 출판, 미디어, 환경, 바이오 산업 등에서 특히 좋은 성과를 거둘 수 있습니다. 새로운 아이디어를 제시하고 발전시키는 능력이 뛰어나며, 조직에서는 기획이나 개발 부서에서 핵심 역할을 맡게 될 가능성이 높습니다.\n\n당신의 성장 욕구와 학습 능력은 경력 발전에 큰 도움이 됩니다. 지속적인 자기계발을 통해 전문성을 키워나가며, 새로운 트렌드나 기술을 빠르게 습득하여 업계에서 인정받는 전문가가 될 수 있습니다. 또한 사람들과의 네트워킹 능력도 뛰어나서, 인맥을 통한 기회도 많이 얻게 됩니다.\n\n다만 너무 많은 분야에 관심을 가지다 보면 전문성이 부족해질 수 있으니, 핵심 분야를 정해서 집중하는 것이 중요합니다. 또한 인내심을 기르고 장기적인 관점에서 경력을 쌓아간다면 큰 성공을 거둘 수 있습니다.",
      "love": "목 오행의 당신은 따뜻하고 성장하는 관계를 추구합니다. 연인과 함께 발전하고 성장해나가는 것을 중요하게 여기며, 서로의 꿈과 목표를 지지해주는 관계를 만들어갑니다. 로맨틱하고 감성적인 면이 강해서, 특별한 기념일이나 이벤트를 소중히 여기고 상대방을 위한 깜짝 선물이나 서프라이즈를 준비하는 것을 좋아합니다.\n\n대화를 통한 소통을 중시하며, 상대방의 마음을 이해하고 공감하려고 노력합니다. 갈등이 생겼을 때도 감정적으로 대응하기보다는 대화를 통해 해결하려고 하며, 서로의 입장을 존중하는 성숙한 연애관을 가지고 있습니다.\n\n다만 너무 이상적인 사랑을 꿈꾸다 보면 현실과 괴리감을 느낄 수 있고, 상대방에게 과도한 기대를 할 수도 있습니다. 완벽한 사랑보다는 서로의 부족함을 인정하고 받아들이는 성숙함이 필요합니다. 수나 화 오행의 사람과 특히 좋은 궁합을 이룰 수 있습니다.",
      "health": "목 오행의 당신은 전반적으로 활력이 넘치고 생명력이 강하지만, 스트레스에 민감한 편입니다. 특히 간과 담, 눈, 근육계통에 주의가 필요합니다. 과도한 업무나 스트레스로 인해 간 기능이 저하될 수 있으니, 규칙적인 생활과 적절한 휴식이 중요합니다.\n\n운동은 당신의 건강 유지에 매우 중요한 요소입니다. 특히 요가, 스트레칭, 등산, 조깅 등 유연성과 지구력을 기르는 운동이 좋습니다. 또한 자연과 접촉할 수 있는 야외 활동을 통해 스트레스를 해소하고 정신적 안정을 찾을 수 있습니다.\n\n식단에서는 신선한 채소와 과일을 충분히 섭취하고, 인공 첨가물이나 과도한 기름진 음식은 피하는 것이 좋습니다. 충분한 수분 섭취도 중요하며, 금연과 절주는 필수입니다. 정기적인 건강검진을 통해 간 기능과 시력을 체크하는 것을 권합니다.",
      "wealth": "목 오행의 당신은 꾸준한 성장을 통해 재물을 축적하는 스타일입니다. 한순간에 큰 돈을 벌기보다는, 지속적인 노력과 투자를 통해 점진적으로 자산을 늘려나가는 것이 당신에게 맞는 재테크 방법입니다. 부동산이나 주식 투자보다는 교육이나 자기계발에 투자하여 장기적인 수익을 창출하는 것이 효과적입니다.\n\n새로운 사업 기회에 대한 감각이 뛰어나며, 트렌드를 빠르게 파악하여 성장 가능성이 높은 분야에 투자할 수 있는 안목을 가지고 있습니다. 또한 사람들과의 네트워킹을 통해 좋은 투자 정보를 얻을 수 있으며, 공동 투자나 파트너십을 통한 수익 창출도 가능합니다.\n\n다만 욕심을 부리거나 조급하게 결과를 원한다면 오히려 손실을 볼 수 있으니 주의가 필요합니다. 안정적인 저축 습관을 기르고, 위험도가 높은 투자는 신중하게 접근하는 것이 좋습니다. 장기적인 안목으로 꾸준히 투자한다면 노후에는 풍족한 생활을 할 수 있을 것입니다."
    },
    "화": {
      "career": "화 오행의 당신은 사람들과의 소통이 중요한 분야에서 탁월한 능력을 발휘합니다. 마케팅, 영업, 방송, 연예, 정치, 서비스업 등에서 특히 빛을 발할 수 있으며, 당신의 열정과 카리스마는 조직에 활력을 불어넣는 원동력이 됩니다. 리더십 능력이 뛰어나서 팀을 이끄는 관리직이나 임원직에 오를 가능성이 높습니다.\n\n당신의 창의성과 혁신적인 아이디어는 새로운 사업 영역을 개척하는 데 큰 도움이 됩니다. 또한 위기 상황에서도 침착함을 잃지 않고 해결책을 찾아내는 능력이 있어, 조직에서 핵심 인재로 인정받게 됩니다. 대외적인 업무나 고객 응대에서도 뛰어난 성과를 보일 것입니다.\n\n다만 너무 성급하게 결과를 원하거나 감정적으로 의사결정을 내릴 수 있으니 주의가 필요합니다. 장기적인 계획을 세우고 차근차근 실행해나가는 인내심을 기른다면 더욱 큰 성공을 거둘 수 있습니다. 또한 부하직원들이나 동료들과의 관계에서도 배려심을 가지고 접근하는 것이 중요합니다.",
      "love": "화 오행의 당신은 열정적이고 로맨틱한 연애를 즐깁니다. 사랑에 빠지면 온 마음을 다해 상대방을 위해 노력하며, 감동적인 이벤트나 깜짝 선물로 상대방을 기쁘게 해주는 것을 좋아합니다. 표현력이 뛰어나서 자신의 감정을 솔직하고 직접적으로 전달하며, 상대방도 같은 방식으로 반응해주기를 원합니다.\n\n활발하고 외향적인 성격으로 연인과 함께 다양한 활동을 즐기며, 새로운 경험을 공유하는 것을 중요하게 여깁니다. 여행, 파티, 문화생활 등을 통해 관계를 더욱 돈독하게 만들어가며, 주변 사람들에게도 자랑스럽게 연인을 소개하는 것을 좋아합니다.\n\n다만 너무 강한 표현이나 과도한 관심이 상대방에게 부담이 될 수 있으니 적절한 조절이 필요합니다. 또한 질투심이 강할 수 있어서, 상대방을 믿고 자유를 주는 성숙함이 필요합니다. 목이나 토 오행의 사람과 특히 좋은 궁합을 이룰 수 있으며, 서로의 장점을 살려주는 관계를 만들 수 있습니다.",
      "health": "화 오행의 당신은 에너지가 넘치고 활동적이지만, 심장과 혈관계통, 소장, 혀 등에 주의가 필요합니다. 과도한 스트레스나 흥분상태가 지속되면 혈압이 오르거나 심장에 무리가 갈 수 있으니, 적절한 휴식과 안정을 취하는 것이 중요합니다.\n\n규칙적인 유산소 운동이 건강 유지에 매우 도움이 됩니다. 달리기, 수영, 자전거 타기 등을 통해 심폐기능을 강화하고, 스트레스를 해소할 수 있습니다. 다만 과도한 운동은 오히려 해가 될 수 있으니 적절한 강도로 꾸준히 하는 것이 좋습니다.\n\n식단에서는 매운 음식이나 자극적인 음식을 과도하게 섭취하지 않도록 주의하고, 충분한 수분 섭취를 해야 합니다. 카페인 섭취도 적당히 조절하며, 금연은 필수입니다. 또한 충분한 숙면을 취하여 몸과 마음의 피로를 풀어주는 것이 중요합니다.",
      "wealth": "화 오행의 당신은 활발한 활동과 적극적인 투자를 통해 수익을 창출하는 스타일입니다. 주식, 부동산, 사업 투자 등에서 과감한 결정력을 발휘하여 좋은 수익을 올릴 수 있는 능력을 가지고 있습니다. 또한 사람들과의 네트워킹을 통해 좋은 투자 기회를 많이 접하게 되며, 트렌드에 민감해서 유망한 분야를 빠르게 파악할 수 있습니다.\n\n사업이나 창업에도 적합한 성격을 가지고 있어서, 자신만의 사업을 통해 큰 부를 축적할 가능성이 높습니다. 특히 사람들과 직접 접촉하는 서비스업이나 유통업에서 좋은 성과를 거둘 수 있으며, 마케팅이나 홍보 능력을 활용한 사업도 성공할 수 있습니다.\n\n다만 성급한 투자나 감정적인 판단으로 인한 손실에 주의해야 합니다. 충분한 정보 수집과 분석 없이 투자하거나, 욕심을 부려서 위험도가 높은 투자에만 집중하면 큰 손실을 볼 수 있습니다. 안정적인 투자와 모험적인 투자의 균형을 맞추는 것이 중요합니다."
    },
    "토": {
      "career": "토 오행의 당신은 안정적이고 실용적인 분야에서 뛰어난 성과를 낼 수 있습니다. 건설, 부동산, 농업, 제조업, 금융업 등 기반 산업에서 특히 빛을 발하며, 체계적이고 단계적인 접근을 통해 확실한 결과를 만들어내는 능력이 뛰어납니다. 조직에서는 기획, 관리, 운영 부문에서 핵심적인 역할을 담당하게 될 것입니다.\n\n당신의 신뢰성과 책임감은 상사와 동료들로부터 높은 평가를 받게 하며, 중요한 프로젝트의 책임자로 발탁될 가능성이 높습니다. 또한 위기 상황에서도 침착함을 유지하고 현실적인 해결책을 제시하는 능력이 있어, 조직의 안정화에 크게 기여할 수 있습니다.\n\n장기적인 관점에서 경력을 쌓아나가는 것이 중요하며, 성급하게 결과를 원하기보다는 꾸준히 실력을 쌓아가는 것이 성공의 열쇠입니다. 전문 자격증 취득이나 체계적인 교육을 통해 전문성을 높여나간다면 해당 분야의 전문가로 인정받을 수 있습니다.",
      "love": "토 오행의 당신은 신뢰를 바탕으로 한 안정적인 관계를 선호합니다. 화려하고 자극적인 연애보다는 서로를 깊이 이해하고 의지할 수 있는 든든한 파트너십을 추구합니다. 연인에게는 물질적, 정신적으로 안정감을 제공하며, 미래에 대한 구체적인 계획을 함께 세워나가는 것을 중요하게 여깁니다.\n\n표현이 화려하지는 않지만 진심 어린 마음으로 상대방을 배려하며, 작은 일상 속에서 사랑을 표현하는 것을 좋아합니다. 기념일이나 약속을 소중히 여기며, 한 번 사랑을 시작하면 오래도록 지속되는 관계를 만들어갑니다.\n\n다만 표현이 서툴거나 보수적인 면 때문에 상대방이 답답함을 느낄 수 있으니, 때로는 로맨틱한 이벤트나 감정 표현도 필요합니다. 또한 고집이 센 면이 있어서 갈등 상황에서는 유연함을 발휘하는 것이 중요합니다. 화나 금 오행의 사람과 특히 좋은 궁합을 이루며, 서로 보완적인 관계를 만들 수 있습니다.",
      "health": "토 오행의 당신은 전반적으로 체력이 좋고 지구력이 강하지만, 소화기계통, 특히 위장과 비장, 근육과 살에 주의가 필요합니다. 불규칙한 식사나 과식, 스트레스성 위장 장애가 나타날 수 있으니 규칙적인 식사 습관을 유지하는 것이 중요합니다.\n\n적당한 운동을 통해 체력을 유지하는 것이 좋으며, 특히 근력 운동과 유연성 운동을 병행하는 것이 효과적입니다. 걷기, 요가, 수영 등 부담이 적으면서도 꾸준히 할 수 있는 운동을 선택하여 규칙적으로 실시하는 것을 권합니다.\n\n식단에서는 소화가 잘 되는 음식을 위주로 하고, 과도한 단맛이나 기름진 음식은 피하는 것이 좋습니다. 충분한 섬유질 섭취를 통해 장 건강을 관리하고, 적절한 수분 섭취도 중요합니다. 스트레스 관리를 위한 취미 활동이나 휴식도 건강 유지에 도움이 됩니다.",
      "wealth": "토 오행의 당신은 착실하게 저축하며 안정적으로 재산을 늘려가는 스타일입니다. 위험도가 높은 투자보다는 안전하고 확실한 수익을 보장하는 투자를 선호하며, 부동산이나 정기예금, 안정적인 배당주 등에 관심이 많습니다. 장기적인 관점에서 꾸준히 자산을 축적해나가는 능력이 뛰어나며, 노후 준비도 미리미리 철저하게 하는 편입니다.\n\n부동산 투자에 특히 좋은 감각을 가지고 있어서, 입지나 개발 가능성을 잘 파악하여 좋은 수익을 올릴 수 있습니다. 또한 실물 자산에 대한 선호도가 높아서 금이나 귀금속, 골동품 등에 투자하는 경우도 많습니다.\n\n다만 너무 보수적인 투자만 고집하다 보면 인플레이션을 따라잡지 못할 수 있으니, 적절한 성장 투자도 고려해보는 것이 좋습니다. 신뢰할 수 있는 전문가의 조언을 듣고, 분산 투자를 통해 위험을 관리하면서도 수익률을 높일 수 있는 방법을 찾아보세요."
    },
    "금": {
      "career": "금 오행의 당신은 전문성과 기술이 요구되는 분야에서 탁월한 능력을 발휘합니다. 의료, 법무, 엔지니어링, IT, 연구개발, 컨설팅 등의 분야에서 특히 빛을 발하며, 정확하고 체계적인 업무 처리 능력으로 조직에서 없어서는 안 될 전문가로 인정받게 됩니다.\n\n당신의 완벽주의적 성향과 높은 품질 기준은 프로젝트의 성공을 보장하는 중요한 요소가 됩니다. 또한 분석력과 판단력이 뛰어나서 복잡한 문제를 명확하게 해결하는 능력이 있으며, 위기 상황에서도 냉정한 판단을 내릴 수 있습니다.\n\n리더십 능력도 뛰어나지만, 때로는 너무 높은 기준 때문에 부하직원들이 부담을 느낄 수 있으니 적절한 조절이 필요합니다. 지속적인 자기계발과 전문성 향상을 통해 해당 분야의 최고 전문가로 성장할 수 있으며, 독립적인 사업도 성공할 가능성이 높습니다.",
      "love": "금 오행의 당신은 품격 있고 완벽한 관계를 추구합니다. 외모나 능력뿐만 아니라 내면의 깊이와 품성을 중시하며, 서로를 존중하고 발전시켜주는 관계를 만들어갑니다. 연애에서도 계획적이고 신중한 접근을 하며, 충동적이거나 감정적인 결정보다는 이성적인 판단을 우선시합니다.\n\n표현이 직접적이지는 않지만 세심한 배려와 관심으로 사랑을 표현하며, 상대방의 성장과 발전을 위해 아낌없이 지원해줍니다. 또한 미래에 대한 구체적인 계획을 함께 세우며, 안정적이고 지속가능한 관계를 만들어가는 것을 중요하게 여깁니다.\n\n다만 너무 완벽을 추구하다 보면 상대방에게 부담을 줄 수 있고, 감정 표현이 서툴어서 차갑게 느껴질 수 있습니다. 때로는 감정적인 교감과 로맨틱한 분위기도 필요하며, 상대방의 부족한 점도 너그럽게 받아들이는 포용력이 필요합니다. 토나 수 오행의 사람과 특히 좋은 궁합을 이룰 수 있습니다.",
      "health": "금 오행의 당신은 전반적으로 건강 관리를 체계적으로 하는 편이지만, 호흡기계통, 특히 폐와 기관지, 대장, 피부 등에 주의가 필요합니다. 스트레스나 과로로 인한 면역력 저하가 나타날 수 있으니, 적절한 휴식과 스트레스 해소가 중요합니다.\n\n규칙적인 운동을 통해 체력을 유지하는 것이 좋으며, 특히 호흡을 중시하는 운동인 요가나 태극권, 기공 등이 도움이 됩니다. 또한 신선한 공기를 마실 수 있는 야외 활동도 폐 건강에 좋습니다.\n\n식단에서는 폐와 기관지에 좋은 배, 도라지, 더덕 등을 자주 섭취하고, 매운 음식이나 자극적인 음식은 적당히 조절하는 것이 좋습니다. 충분한 수분 섭취와 함께 금연은 필수이며, 미세먼지가 심한 날에는 외출을 자제하거나 마스크를 착용하는 것이 좋습니다.",
      "wealth": "금 오행의 당신은 투자와 전문 기술을 통해 부를 축적하는 능력이 뛰어납니다. 분석력이 뛰어나서 시장의 흐름을 정확하게 파악하고, 가치 있는 투자처를 찾아내는 안목을 가지고 있습니다. 주식, 채권, 펀드 등 다양한 금융상품에 대한 이해도가 높아서 효과적인 포트폴리오를 구성할 수 있습니다.\n\n전문성을 바탕으로 한 고소득 창출이 가능하며, 컨설팅이나 자문업을 통한 부가 수익도 기대할 수 있습니다. 또한 귀금속이나 보석, 골동품 등 가치 있는 수집품에 투자하는 것도 좋은 수익을 가져다줄 수 있습니다.\n\n다만 너무 완벽한 투자만 추구하다 보면 기회를 놓칠 수 있으니, 적절한 위험 감수도 필요합니다. 또한 감정에 휘둘리지 않는 냉정한 판단력을 유지하면서도, 시장의 변화에 유연하게 대응하는 것이 중요합니다."
    },
    "수": {
      "career": "수 오행의 당신은 유연성과 지혜가 필요한 분야에서 뛰어난 성과를 거둘 수 있습니다. 교육, 연구, 상담, 심리학, 철학, 종교, 예술 분야에서 특히 빛을 발하며, 사람들의 마음을 이해하고 소통하는 능력이 뛰어납니다. 또한 국제적인 업무나 해외와 관련된 일에서도 좋은 능력을 발휘할 수 있습니다.\n\n당신의 직감력과 통찰력은 복잡한 문제의 본질을 파악하고 창조적인 해결책을 찾아내는 데 큰 도움이 됩니다. 또한 학습 능력이 뛰어나서 새로운 분야에도 빠르게 적응할 수 있으며, 변화하는 환경에서도 유연하게 대처할 수 있습니다.\n\n다만 너무 많은 분야에 관심을 가지다 보면 전문성이 부족해질 수 있으니, 핵심 분야를 정해서 깊이 있게 파고드는 것이 중요합니다. 또한 실행력을 기르고 구체적인 성과를 만들어내는 것에도 신경을 써야 합니다.",
      "love": "수 오행의 당신은 깊이 있고 이해심 많은 관계를 추구합니다. 상대방의 마음을 깊이 이해하고 공감하는 능력이 뛰어나며, 서로의 내면을 탐구하고 성장해나가는 관계를 만들어갑니다. 감성적이고 로맨틱한 면이 강해서, 시나 음악, 예술을 통한 감정 표현을 좋아합니다.\n\n대화를 통한 소통을 매우 중시하며, 철학적이고 깊이 있는 대화를 나누는 것을 즐깁니다. 또한 상대방의 꿈과 이상을 이해하고 지지해주며, 함께 성장하고 발전해나가는 것을 중요하게 여깁니다.\n\n다만 너무 이상적인 사랑을 추구하다 보면 현실과의 괴리감을 느낄 수 있고, 감정의 변화가 심해서 상대방이 혼란스러워할 수 있습니다. 안정적이고 일관된 태도를 유지하려고 노력하고, 현실적인 관점도 함께 가지는 것이 필요합니다. 금이나 목 오행의 사람과 특히 좋은 궁합을 이룰 수 있습니다.",
      "health": "수 오행의 당신은 전반적으로 회복력이 뛰어나고 적응력이 좋지만, 신장과 방광, 생식기, 귀, 뼈와 치아 등에 주의가 필요합니다. 과로나 스트레스로 인한 신장 기능 저하나 요로계 질환이 나타날 수 있으니, 충분한 휴식과 수분 섭취가 중요합니다.\n\n규칙적인 운동을 통해 체력을 유지하되, 과도한 운동보다는 적절한 강도의 운동을 꾸준히 하는 것이 좋습니다. 수영이나 아쿠아로빅 등 물과 관련된 운동이 특히 도움이 되며, 명상이나 요가를 통한 정신적 안정도 중요합니다.\n\n식단에서는 신장에 좋은 검은콩, 검은깨, 해조류 등을 자주 섭취하고, 짠 음식이나 인스턴트 식품은 피하는 것이 좋습니다. 충분한 수분 섭취는 필수이며, 규칙적인 수면을 통해 몸의 회복력을 높이는 것이 중요합니다. 정기적인 건강검진을 통해 신장 기능을 체크하는 것을 권합니다.",
      "wealth": "수 오행의 당신은 다양한 방법으로 수익원을 만들어가는 능력이 뛰어납니다. 고정된 한 가지 수입원보다는 여러 개의 수입원을 통해 안정적인 수익을 창출하는 것을 선호하며, 변화하는 시장 상황에 빠르게 적응하여 새로운 기회를 찾아내는 능력이 있습니다.\n\n국제적인 투자나 해외 관련 사업에서 좋은 성과를 거둘 수 있으며, 부동산이나 주식보다는 지적 재산권이나 저작권, 특허 등을 통한 수익 창출에 관심이 많습니다. 또한 교육이나 컨설팅을 통한 지식 판매도 좋은 수익원이 될 수 있습니다.\n\n다만 변덕스러운 면이 있어서 일관된 투자 전략을 유지하기 어려울 수 있으니, 장기적인 계획을 세우고 꾸준히 실행하는 것이 중요합니다. 또한 너무 복잡한 금융상품보다는 이해하기 쉽고 투명한 투자처를 선택하는 것이 좋습니다."
    }
  },
  "yearlyFortune": {
    "2025": {
      "general": "을사년인 2025년은 전반적으로 성장과 변화의 해입니다. 뱀띠의 지혜로운 에너지와 을목의 유연함이 만나면서, 새로운 기회와 도전이 많이 찾아올 것입니다. 특히 상반기에는 인간관계에서 좋은 변화가 있을 것이며, 하반기에는 사업이나 투자 면에서 성과를 거둘 수 있을 것입니다.",
      "months": {
        "1": "새해를 맞아 새로운 계획과 목표를 세우기에 좋은 달입니다. 직장에서 승진이나 이직의 기회가 찾아올 수 있으며, 새로운 인맥을 만날 가능성도 높습니다.",
        "2": "재물운이 상승하는 달로, 부업이나 투자를 통한 수익이 기대됩니다. 다만 충동적인 소비는 자제하고 신중한 계획이 필요합니다.",
        "3": "건강에 주의가 필요한 달입니다. 과로나 스트레스로 인한 몸의 신호를 놓치지 마시고, 적절한 휴식을 취하세요.",
        "4": "연애운이 상승하는 달로, 새로운 만남이나 기존 관계의 발전이 기대됩니다. 진실한 마음으로 소통한다면 좋은 결과를 얻을 수 있습니다.",
        "5": "가족이나 친지와 관련된 경사가 있을 수 있는 달입니다. 주변 사람들과의 화합을 통해 더 큰 행복을 얻을 수 있을 것입니다.",
        "6": "학업이나 자기계발에 좋은 성과가 있는 달입니다. 새로운 기술이나 지식을 익히는 것이 미래에 큰 도움이 될 것입니다.",
        "7": "여행이나 이주와 관련된 변화가 있을 수 있는 달입니다. 새로운 환경에서 새로운 기회를 발견할 수 있을 것입니다.",
        "8": "사업이나 투자에서 중요한 결정을 내려야 하는 달입니다. 신중한 판단과 전문가의 조언을 구하는 것이 좋습니다.",
        "9": "인간관계에서 갈등이 생길 수 있는 달입니다. 감정적으로 대응하기보다는 이성적인 대화를 통해 해결하려고 노력하세요.",
        "10": "창업이나 새로운 사업을 시작하기에 좋은 달입니다. 오랫동안 준비해온 계획이 있다면 실행에 옮기기 좋은 시기입니다.",
        "11": "재물운이 매우 좋은 달로, 투자나 부동산 거래에서 좋은 성과를 거둘 수 있습니다. 다만 욕심을 부리지 말고 적절한 선에서 만족하세요.",
        "12": "한 해를 마무리하며 성과를 정리하고 내년을 준비하는 달입니다. 감사하는 마음으로 주변 사람들과 좋은 시간을 보내세요."
      }
    }
  },
  "luckyItems": {
    "목": {
      "colors": ["초록색", "청록색", "연두색", "하늘색"],
      "numbers": [3, 4, 8, 12, 21, 30],
      "directions": ["동쪽", "동남쪽"],
      "items": ["화분", "나무 소재 액세서리", "에메랄드", "제이드", "대나무 제품"],
      "foods": ["채소", "과일", "견과류", "녹차", "허브차"]
    },
    "화": {
      "colors": ["빨간색", "주황색", "분홍색", "자주색"],
      "numbers": [2, 7, 9, 16, 25, 34],
      "directions": ["남쪽", "남동쪽"],
      "items": ["촛불", "빨간 장미", "루비", "가넷", "태양 모양 장식"],
      "foods": ["매운 음식", "붉은 과일", "견과류", "홍차", "인삼차"]
    },
    "토": {
      "colors": ["노란색", "갈색", "베이지색", "황토색"],
      "numbers": [5, 6, 10, 15, 24, 33],
      "directions": ["중앙", "남서쪽", "북동쪽"],
      "items": ["도자기", "황금 액세서리", "호박", "황수정", "돌 조각품"],
      "foods": ["곡물", "뿌리채소", "꿀", "대추", "현미차"]
    },
    "금": {
      "colors": ["흰색", "은색", "금색", "회색"],
      "numbers": [1, 6, 11, 17, 26, 35],
      "directions": ["서쪽", "북서쪽"],
      "items": ["금속 액세서리", "시계", "동전", "수정", "백옥"],
      "foods": ["흰 음식", "배", "도라지", "우유", "백차"]
    },
    "수": {
      "colors": ["검은색", "남색", "짙은 파란색", "회색"],
      "numbers": [1, 4, 9, 13, 22, 31],
      "directions": ["북쪽", "북동쪽"],
      "items": ["물그릇", "거울", "흑요석", "진주", "파란 보석"],
      "foods": ["해산물", "검은콩", "블루베리", "물", "차"]
    }
  }
}
